# GetNumSelectedLBItems

## Description
Returns the number of selected list browser items.

```pascal
FUNCTION GetNumSelectedLBItems(
				dialogID    : LONGINT;
				componentID : LONGINT) : INTEGER;
```

```python

def vs.GetNumSelectedLBItems(dialogID, componentID):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|

## Version
Availability: from VectorWorks12.0
## Category
* Dialogs - Modern - Browser